Repository: Stanford-Mobisocial-IoT-Lab/thingengine-core
Catalog: po/*.po
Languages: it

source: This app has no description
it: Questa app non ha descrizione.

source: User not available to respond
it: L'utente non è disponibile a rispondere

source: Generic Bluetooth Device %s
it: Dispositivo Bluetooth Generico %s

source: This is a Bluetooth device of unknown or generic type
it: Questo è un dispositivo Bluetooth di tipo generico o sconosciuto

source: This Almond has no bluetooth capability
it: Questo Almond non supporta il Bluetooth

source: Insert your email address or phone number:
it: Inserisci il tuo numero di telefono o indirizzo email:

source: Insert your password:
it: Inserisci la tua password:

source: Authentication failed: %s
it: Authenticazione fallita: %s

source: Matrix Account of %s
it: Account Matrix di %s

source: This is your Matrix Account.
it: Questo è il tuo account Matrix.

source: Hi!
it: Ciao!

source: I know, right?
it: Vero?

source: No need to be sorry.
it: Non c'è motivo di scusarsi.

source: At your service.
it: Al tuo servizio.

source: Miscellaneous Interfaces
it: Miscellanea

source: Time, randomness and other non-device specific things.
it: Orario, casualità e altre cose non specifiche di un dispositivo.

source: Sorry, I cannot access your location in this version of Almond.
it: Mi dispiace, ma non posso accedere alla tua posizione in questa versione di Almond.

source: Unknown
it: Ignota

source: User not available
it: Utente non disponibile

source: Opening files is not implemented in this Almond
it: L'apertura di file non è implementata in questo Almond

source: This is one of your own Almond apps.
it: Questo è una delle tue app Almond.

source: Unknown device
it: Dispositivo sconosciuto

source: Description not available
it: Descrizione non disponibile

source: Generic Bluetooth Device
it: Dispositivo Bluetooth Generico

source: The most generic of Bluetooth classes, it supports no operation at all. It is used if nothing more specific is found.
it: La più generica di tutte le classi Bluetooth. Non supporta alcuna operazione, ed è usata solo se non è trovata una classe più specifica.

source: The Matrix.org federated chat service
it: Il servizio di chat federato Matrix.org

source: Test Device
it: Dispositivo di Test

source: Test Almond in various ways
it: Testa Almond in vari modi

source: get data on test
it: ottieni dati di test

source: generate $size of fake data
it: genera $size di dati fasulli

source: generate $size of fake data on $__person's Almond
it: genera $size di dati fasulli sull'Almond di $__person

source: How much fake data do you want?
it: Quanti dati fasulli vuoi?

source: get sequence number on test
it: ottieni numero di sequenza di test

source: return the next test number
it: ritorna il prossimo numero di test

source: duplicate data on test
it: duplica dati di test

source: duplicate ${data_in} data
it: duplica i dati ${data_in}

source: What data do you want to duplicate?
it: Quali dati vuoi duplicare?

source: eat data on test
it: mangia dati di test

source: consume $data
it: consuma $data

source: consume $data on $__person's Almond
it: consuma $data sull'Almond di $__person

source: What do you want me to consume?
it: Che cosa vuoi che io consumi?

source: say
it: dici

source: ask me a question $question
it: fammi una domanda $question

source: ask $__person question $question
it: fai la domanda $question a $__person

source: What do you want me to ask?
it: Che cosa vuoi che io domandi?

source: Commands that are always available and don't belong to any specific device or account. Mostly related to time and randomness, because the universe is chaos and those always there. Also debugging.
it: Comandi che sono sempre disponibili e non appartengono a un dispositivo o account specifico. Per lo più relativi al tempo e al caso, perché l'universo è caos e ad essi non si può sfuggire. E anche debugging.

source: get current location
it: posizione corrente

source: your location
it: la tua posizione

source: $__person's location
it: la posizione di $__person

source: Current Location: ${location}
it: Posizione corrente: ${location}

source: What location are you interested in?
it: A quale posizione sei interessato?

source: location
it: località

source: altitude
it: altitudine

source: bearing
it: direzione

source: speed
it: velocità

source: get time
it: ottieni ora

source: the current time
it: l'ora attuale

source: Current time is ${time:time}.
it: L'ora attuale è ${time:time}.

source: get date
it: ottieni data

source: today's date
it: la data di oggi

source: Today is ${date:date}.
it: Oggi è il ${date:date}.

source: get random integer
it: ottieni intero casuale

source: a random integer between $low and $high
it: un numero intero casuale tra $low e $high

source: What should be the lower bound?
it: Qual è l'estremo inferiore?

source: What should be the upper bound?
it: Qual è l'estremo superiore?

source: list commands
it: lista comandi

source: the list of commands of $device
it: la lista dei comandi di $device

source: What device do you want help for?
it: Per quale dispositivo hai bisogno di aiuto?

source: get canned reply
it: ottieni risposta confezionata

source: a reply to ${intent}
it: una risposta a ${intent}

source: log
it: registro

source: write $message in the developer logs
it: scrivi $message nei registri di sviluppo

source: write $message in the developer logs on $__person's phone
it: scrivi $message nei registri di sviluppo di $__person

source: What should I write in the logs?
it: Cosa devo scrivere nel registro?

source: configure
it: configura

source: configure a new $device
it: configura un nuovo $device

source: configure a new $device on $__person's Almond
it: configura un nuovo $device nell'Almond di $__person

source: What device do you want to configure?
it: Quale dispositivo vuoi configurare?

source: send me a message $message
it: mandami un messaggio $message

source: send $__person message $message
it: manda un messaggio $message a $__person

source: What do you want me to say?
it: Che cosa vuoi che io dica?

source: discover
it: scopri

source: search for new devices
it: cerca nuovi dispositivi

source: search for new devices on $__person's Almond
it: cerca nuovi dispositivi nell'Almond di $__person

source: open url on builtin
it: apri url su builtin

source: open $url
it: apri $url

source: open $url in $__person's PC
it: apri $url nel PC di $__person

source: What URL do you want to open?
it: Quale URL vuoi aprire?

source: Remote Almond
it: Almond remoto

source: A proxy device for a Almond owned by a different user. This device is created and managed automatically by the system.
it: Un dispositivo proxy per un Almond di proprietà di un utente diverso. Questo dispositivo è creato e gestito automaticamente dal sistema.

source: Almond Configuration
it: Configurazione di Almond

source: A placeholder for configuration parameters of Almond. This device is created and loaded automatically by the system.
it: Un contenitore per i parametri di configurazione di Almond. Questo dispositivo è creato e gestito automaticamente dal sistema.
